With this configuration (equivalent to the one above)

```hcl
provider "aws" {}
provider "awscc" {}

resource "aws_kms_key" "test" {
  description             = "ewbankkit-test"
  deletion_window_in_days = 7
}

resource "awscc_healthlake_fhir_datastore" "test" {
  datastore_name         = "ewbankkit-test"
  datastore_type_version = "R4"
  sse_configuration = {
    kms_encryption_config = {
      cmk_type   = "CUSTOMER_MANAGED_KMS_KEY"
      kms_key_id = aws_kms_key.test.arn
    }
  }
  tags = [
    {
      key   = "Name"
      value = "ewbankkit-test"
    }
  ]
}
```

I see

```console
% terraform plan

aws_kms_key.test: Refreshing state... [id=0bc14a40-8606-4562-bd30-a24f0f3de6ed]
awscc_healthlake_fhir_datastore.test: Refreshing state... [id=f4e299a53f00f2fd719f9963e8be0bd5]

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the last "terraform apply":

  # aws_kms_key.test has been changed
  ~ resource "aws_kms_key" "test" {
        id                                 = "0bc14a40-8606-4562-bd30-a24f0f3de6ed"
      + tags                               = {}
        # (13 unchanged attributes hidden)
    }
  # awscc_healthlake_fhir_datastore.test has been changed
  ~ resource "awscc_healthlake_fhir_datastore" "test" {
        id                              = "f4e299a53f00f2fd719f9963e8be0bd5"
      ~ sse_configuration               = {
        ~ kms_encryption_config = {
          ~ kms_key_id = "0bc14a40-8606-4562-bd30-a24f0f3de6ed" -> "arn:aws:kms:us-west-2:123456789012:key/0bc14a40-8606-4562-bd30-a24f0f3de6ed"
            # (1 unchanged attribute hidden)
        }
      }
        tags                            = [
            {          },
          # (1 unchanged element hidden)
        ]
        # (8 unchanged attributes hidden)
    }

Unless you have made equivalent changes to your configuration, or ignored the relevant attributes using ignore_changes, the following plan
may include actions to undo or respond to these changes.

───────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution plan. Resource actions are indicated with the following symbols:
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # awscc_healthlake_fhir_datastore.test must be replaced
-/+ resource "awscc_healthlake_fhir_datastore" "test" {
      ~ created_at                      = {
        ~ nanos   = 441000000 -> (known after apply)
        ~ seconds = "1720462542" -> (known after apply)
      }
      ~ datastore_arn                   = "arn:aws:healthlake:us-west-2:123456789012:datastore/fhir/f4e299a53f00f2fd719f9963e8be0bd5" -> (known after apply)
      ~ datastore_endpoint              = "https://healthlake.us-west-2.amazonaws.com/datastore/f4e299a53f00f2fd719f9963e8be0bd5/r4/" -> (known after apply)
      ~ datastore_id                    = "f4e299a53f00f2fd719f9963e8be0bd5" -> (known after apply)
      ~ datastore_status                = "ACTIVE" -> (known after apply)
      ~ id                              = "f4e299a53f00f2fd719f9963e8be0bd5" -> (known after apply)
      ~ identity_provider_configuration = {
        ~ authorization_strategy             = "AWS_AUTH" -> (known after apply)
        ~ fine_grained_authorization_enabled = false -> (known after apply)
        + idp_lambda_arn                     = (known after apply)
        + metadata                           = (known after apply)
      }
      + preload_data_config             = {
        + preload_data_type = (known after apply)
      }
      ~ sse_configuration               = { # forces replacement
        ~ kms_encryption_config = { # forces replacement
          ~ kms_key_id = "arn:aws:kms:us-west-2:123456789012:key/0bc14a40-8606-4562-bd30-a24f0f3de6ed" -> "0bc14a40-8606-4562-bd30-a24f0f3de6ed"
            # (1 unchanged attribute hidden)
        }
      }
        tags                            = [
            {          },
          # (1 unchanged element hidden)
        ]
        # (2 unchanged attributes hidden)
    }

Plan: 1 to add, 0 to change, 1 to destroy.

───────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't guarantee to take exactly these actions if you run "terraform
apply" now.
```